%问题1拟合得到4次曲线,并估计从9.8V开始剩余放电时间
clear;
X=xlsread('2016C附件','附件1');

[m,n]=size(X);
N=[1883,1883,1228,863,655,523,432,366,311,270];  %各列数据总数
t98=[0,2826,1860,1294, 980, 766,606,498,412,344]; %U=9.8的最近观测时间
t90=[0,3764,2454,1724,1308,1044,862,730,620,536]; %U=9.0的最近观测时间


 %得到4次拟合曲线
       
    for k=3:7
    t=zeros(N(k),1);
    v=zeros(N(k),1);
 for i=1:N(k)
  t(i)=X(i,1);
  v(i)=X(i,k);
 end
 [P,S] = polyfit(t,v,4);
  fprintf('电流强度%2d\n',k*10);
  fprintf('4次多项式拟合参数:\n');
 for i=1:5
  fprintf('%6.4e ',P(i));
 end
 fprintf('\n\n');

 
 nv=P(1)*t.^4+P(2)*t.^3+P(3)*t.^2+P(4)*t+P(5);

 plot(t,v,'b',t,nv,'r');
 
 fprintf('采用牛顿迭代法求根:\n');
   U1=9.8;
  t10=t98(k);
 for i=1:5
 ft=P(1)*t10^4+P(2)*t10^3+P(3)*t10^2+P(4)*t10+P(5)-U1; %迭代函数
 dft=4*P(1)*t10^3+3*P(2)*t10^2+2*P(3)*t10+P(4);  %导数
 t11=t10-ft/dft;
 fprintf('U1=%6.2f,i=%2d,t1=%6.2f\n',U1,i,t11);
 t10=t11;
 end
 ft1=t11;
 
 
   fprintf('\n');
  U2=9.0;
  t20=t90(k);
 for i=1:5
 ft=P(1)*t20^4+P(2)*t20^3+P(3)*t20^2+P(4)*t20+P(5)-U2; %迭代函数
 dft=4*P(1)*t20^3+3*P(2)*t20^2+2*P(3)*t20+P(4);  %导数
 t21=t20-ft/dft;
 fprintf('U2=%6.2f,i=%2d,t1=%6.2f\n',U2,i,t21);
 t20=t21;
 end
 ft2=t21;
 dt1=ft2-ft1; %估计剩余放电时间
 dt2=t90(k)-t98(k);  %观测剩余放电时间
 fprintf('U=%3.1f,估计值t1=%6.2f  U=%3.1f t2=%6.2f 剩余放电时间为:%6.2f\ n',U1,ft1,U2,ft2,dt1);
 fprintf('U=%3.1f,观测值t1=%6.2f  U=%3.1f t2=%6.2f 剩余放电时间为:%6.2f\ n',U1,t98(k),U2,t90(k),dt2);
 fprintf('相对误差%6.2f%%\n',abs(dt1-dt2)/dt2*100);
    end
